Documents/ИзменениеМетодаСписанияСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>ИзменениеМетодаСписанияСебестоимости</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИзменениеМетодаСписанияСебестоимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МетодСписанияСебестоимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МетодыСписанияСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИзменениеМетодаСписанияСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ИзменениеМетодаСписанияСебестоимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодСписанияСебестоимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МетодыСписанияСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеМетодаСписанияСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ИзменениеМетодаСписанияСебестоимости/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИзменениеМетодаСписанияСебестоимости
	Движения.ИзменениеМетодаСписанияСебестоимости.Записывать = Истина;
	Движение = Движения.ИзменениеМетодаСписанияСебестоимости.Добавить();
	Движение.Период = Дата;
	Движение.ДокументОснование = Ссылка;
	Движение.МетодСписанияСебестоимости = МетодСписанияСебестоимости;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
